gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_flow/Hardware/NET/net_nbiot_app.c
void NET_NBIOT_OneNETPrivateStructureInit(void)
{
	memset((void*)&OneNETPrivateStructure.PrivateData, 0, sizeof(OneNETPrivateStructure.PrivateData));
	OneNETPrivateStructure.HeadPacket.DeviceSN				= TCFG_EEPROM_Get_MAC_SN();
	OneNETPrivateStructure.HeadPacket.DataLen				= 0x00;
	OneNETPrivateStructure.HeadPacket.ProtocolType			= 0x00;
	OneNETPrivateStructure.HeadPacket.Reserved1				= 0x00;
	OneNETPrivateStructure.HeadPacket.ProtocolVersion			= 0x00;
	OneNETPrivateStructure.HeadPacket.Reserved2				= 0x00;
	OneNETPrivateStructure.HeadPacket.PacketType				= 0x07;
	OneNETPrivateStructure.HeadPacket.PacketNumber			= 0x00;
	OneNETPrivateStructure.MsgPacket.DestSN					= 0x00;
	OneNETPrivateStructure.MsgPacket.Version				= 0x01;
}

void NET_NBIOT_OneNETSentDataAfterExexution(void)
{
	TCFG_Utility_Add_NBIot_SentCount();
	TCFG_Utility_Add_NBIot_SentCountDay();
}
#endif

/**********************************************************************************************************
 @Function			void NET_NBIOT_DataProcessing(NET_NBIOT_ClientsTypeDef* pClient)
 @Description			NET_NBIOT_DataProcessing						: NET数据处理
 @Input				void
 @Return				void
**********************************************************************************************************/
void NET_NBIOT_DataProcessing(NET_NBIOT_ClientsTypeDef* pClient)
{
#if NETPROTOCAL == NETCOAP
	
	u32 len = 0;
	FlowStatusTypeDef FlowStatusData;
	
	/* 检查是否有数据需要发送 */
	if (Inspect_Message_FlowStatusisEmpty() == false) {
	#if NBCOAP_SENDCODE_LONG_STATUS
		NETCoapNeedSendCode.LongStatus = 1;
	#endif
	}
	
	/* COAP SHORT STATUS DATA ENQUEUE */
	if (NETCoapNeedSendCode.ShortStatus) {
#if NBCOAP_SENDCODE_SHORT_STATUS
		Inspect_Message_FlowStatusDequeue(&FlowStatusData);
		NET_NBIOT_CoapShortStructureInit();
		CoapShortStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_SHORT_STATUS;
		CoapShortStructure.DateTime						= FlowStatusData.unixTime;
		CoapShortStructure.SpotStatus						= FlowStatusData.FlowState;
		CoapShortStructure.SpotCount						= FlowStatusData.FlowCount;
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapShortStructure, sizeof(CoapShortStructure));
		NETCoapNeedSendCode.ShortStatus = 0;
		Inspect_Message_FlowStatusOffSet();
		NET_NBIOT_CoapSentDataAfterExexution();
#endif
	}
	/* COAP LONG STATUS DATA ENQUEUE */
	else if (NETCoapNeedSendCode.LongStatus) {
#if NBCOAP_SENDCODE_LONG_STATUS
		Inspect_Message_FlowStatusDequeue(&FlowStatusData);
		NET_NBIOT_CoapLongStructureInit();
		CoapLongStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_LONG_STATUS;
		CoapLongStructure.DateTime						= FlowStatusData.unixTime;
		CoapLongStructure.SpotStatus						= FlowStatusData.FlowState;
		CoapLongStructure.SpotCount						= FlowStatusData.FlowCount;
		CoapLongStructure.MagneticX						= FlowStatusData.magnetismX;
		CoapLongStructure.MagneticY						= FlowStatusData.magnetismY;
		CoapLongStructure.MagneticZ						= FlowStatusData.magnetismZ;
		CoapLongStructure.MagneticDiff					= FlowStatusData.waitSendFlowCarCount;
		CoapLongStructure.RadarDistance					= FlowStatusData.carinThreshhold;
		CoapLongStructure.RadarStrength					= FlowStatusData.caroutThreshhold;
		CoapLongStructure.RadarCoverCount					= FlowStatusData.recalibrationOvertime;
		CoapLongStructure.RadarDiff						= FlowStatusData.detectMode;
#if NBIOT_STATUS_MSG_VERSION_TYPE == NBIOT_STATUS_MSG_VERSION_77BYTE_V2
		CoapLongStructure.NBRssi							= TCFG_Utility_Get_Nbiot_Rssi_IntVal();
		CoapLongStructure.NBSnr							= TCFG_Utility_Get_Nbiot_RadioSNR();
		CoapLongStructure.MCUTemp						= TCFG_Utility_Get_Device_Temperature();
		CoapLongStructure.QMCTemp						= Qmc5883lData.temp_now;
		CoapLongStructure.MagneticBackX					= FlowStatusData.magnetismBackX;
		CoapLongStructure.MagneticBackY					= FlowStatusData.magnetismBackY;
		CoapLongStructure.MagneticBackZ					= FlowStatusData.magnetismBackZ;
		CoapLongStructure.Debugval						= FlowStatusData.waitSendHeartbeatMin;
		for (int i = 0; i < 16; i++) {
			CoapLongStructure.Radarval[i] = 0;
			CoapLongStructure.Radarback[i] = 0;
		}
#endif
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapLongStructure, sizeof(CoapLongStructure));
		NETCoapNeedSendCode.LongStatus = 0;
		Inspect_Message_FlowStatusOffSet();
		NET_NBIOT_CoapSentDataAfterExexution();
#endif
	}
	/* COAP WORK INFO DATA ENQUEUE */
	else if (NETCoapNeedSendCode.WorkInfo) {
#if NBCOAP_SENDCODE_WORK_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_CoapInfoStructureInit();
		CoapInfoStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_WORK_INFO;
		len = NET_COAP_Message_Operate_Creat_Json_Work_Info((char *)&CoapInfoStructure.InfoData);
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapInfoStructure, sizeof(CoapInfoStructure) - sizeof(CoapInfoStructure.InfoData) + len);
		NETCoapNeedSendCode.WorkInfo = 0;
		NET_NBIOT_CoapSentDataAfterExexution();
#endif
	}
	/* COAP BASIC INFO DATA ENQUEUE */
	else if (NETCoapNeedSendCode.BasicInfo) {
#if NBCOAP_SENDCODE_BASIC_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_CoapInfoStructureInit();
		CoapInfoStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_BASIC_INFO;
		len = NET_COAP_Message_Operate_Creat_Json_Basic_Info((char *)&CoapInfoStructure.InfoData);
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapInfoStructure, sizeof(CoapInfoStructure) - sizeof(CoapInfoStructure.InfoData) + len);
		NETCoapNeedSendCode.BasicInfo = 0;
		NET_NBIOT_CoapSentDataAfterExexution();
#endif
	}
	/* COAP DYNAMIC INFO DATA ENQUEUE */
	else if (NETCoapNeedSendCode.DynamicInfo) {
#if NBCOAP_SENDCODE_DYNAMIC_INFO
		if (TCFG_Utility_Get_Nbiot_Registered() != true) {
			return;
		}
		NET_NBIOT_CoapInfoStructureInit();
		CoapInfoStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_DYNAMIC_INFO;
		len = NET_COAP_Message_Operate_Creat_Json_Dynamic_Info((char *)&CoapInfoStructure.InfoData);
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapInfoStructure, sizeof(CoapInfoStructure) - sizeof(CoapInfoStructure.InfoData) + len);
		NETCoapNeedSendCode.DynamicInfo = 0;
		NET_NBIOT_CoapSentDataAfterExexution();
#endif
	}
	/* COAP Qmc5883L DATA ENQUEUE */
	else if (NETCoapNeedSendCode.QmcData) {
#if NBCOAP_SENDCODE_QMC_DATA
		NET_NBIOT_CoapPrivateStructureInit();
		CoapPrivateStructure.MsgPacket.Type				= COAP_MSGTYPE_TYPE_QMC_DATA;
		len = NET_COAP_Message_Operate_Creat_Qmc5883L_Data((unsigned char *)&CoapPrivateStructure.PrivateData);
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapPrivateStructure, sizeof(CoapPrivateStructure) - sizeof(CoapPrivateStructure.PrivateData) + len);
		NETCoapNeedSendCode.QmcData = 0;
		NET_NBIOT_CoapSentDataAfterExexution();
#endif
	}
	/* COAP RESPONSE INFO DATA ENQUEUE */
	else if (NETCoapNeedSendCode.ResponseInfo) {
#if NBCOAP_SENDCODE_RESPONSE_INFO
		NET_NBIOT_CoapInfoStructureInit();
		CoapInfoStructure.MsgPacket.Type					= COAP_MSGTYPE_TYPE_INFO;
		len = NET_COAP_Message_Operate_Creat_Json_Response_Info((char *)&CoapInfoStructure.InfoData, NETCoapNeedSendCode.ResponseInfoErrcode);
		NET_Coap_Message_SendDataEnqueue((unsigned char *)&CoapInfoStructure, sizeof(CoapInfoStructure) - sizeof(CoapInfoStructure.InfoData) + len);
		NETCoapNeedSendCode.ResponseInfo = 0;
		NET_NBIOT_CoapSentDataAfterExexution();
#endif
	}
	
#elif NETPROTOCAL == NETMQTTSN
	
